In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
data = pd.DataFrame()
data

Empty DataFrame
Columns: []
Index: []

In [6]:
max_list=pd.DataFrame()

Data dataframe:used to hold the names' after concatenating,the data from year of birth'

In [7]:
file="C:/Users/lenovo/Desktop/DataScience/Python/Project 1/names/yob{}.txt"
for i in range(1880,2019):
    d=pd.read_csv(file.format(i),header=None)
    d[3]=i
    data=pd.concat([data,d],axis=0,ignore_index=True)

In [9]:
data.rename(columns={0:'name',1:'gender',2:'NameCount',3:'year'},inplace=True)

In [10]:
data.head()

        name gender  NameCount  year
0       Mary      F       7065  1880
1       Anna      F       2604  1880
2       Emma      F       2003  1880
3  Elizabeth      F       1939  1880
4     Minnie      F       1746  1880

This DataFrame is used: to hold the names' from each year,which has the maximum count(aim:3)

In [18]:
file="C:/Users/lenovo/Desktop/DataScience/Python/Project 1/names/yob{}.txt"
for i in range(1880,2019):
    df=pd.read_csv(file.format(i),header=None)
    df_max=df[df[2]==df[2].max()]
    df_max['year']=i
    max_list=pd.concat( [max_list,df_max],axis=0)

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [22]:
max_list.head()

         0  1     2  year
942   John  M  9655  1880
938   John  M  8769  1881
1028  John  M  9557  1882
1054  John  M  8894  1883
1172  John  M  9388  1884

In [24]:
names=max_list[0].unique()
names

array(['John', 'Mary', 'Robert', 'James', 'Linda', 'Michael', 'David',
       'Jacob', 'Isabella', 'Sophia', 'Emma', 'Liam'], dtype=object)